tiem-alpha/ESP32_NUS_NAV_MAP/esp32/main/display.c
/*
 * SPDX-FileCopyrightText: 2026
 * SPDX-License-Identifier: Unlicense OR CC0-1.0
 *
 * display.c — ST7789 (esp_lcd SPI) + LVGL v8.3 full-screen map + overlay.
 *
 * Ràng buộc RAM (ESP32-H2, KHÔNG PSRAM): không cấp full framebuffer.
 * Dùng LVGL partial draw buffer theo tỉ lệ SCREEN_W × SCREEN_H.
 *
 * Map vẽ bằng custom draw (LV_EVENT_DRAW_MAIN của 1 obj full-screen) qua
 * lv_draw_line — KHÔNG lv_canvas. Overlay = widget LVGL con nền bán trong suốt.
 *
 * Mọi truy cập LVGL (UI update + lv_timer_handler) bọc trong mutex đệ quy.
 */
#include "display.h"

#include <assert.h>
#include <stdio.h>
#include <string.h>

#include "esp_idf_version.h"

#include "driver/gpio.h"
#include "driver/spi_master.h"
#include "esp_heap_caps.h"
#include "esp_lcd_panel_io.h"
#include "esp_lcd_panel_ops.h"
#include "esp_lcd_panel_vendor.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "lvgl.h"
#include "sdkconfig.h"

#include "clock_model.h"
#include "map_model.h"
#include "nav_model.h"
#include "nav_proto.h"
#include "projection.h"

#define DISP_TAG "DISPLAY"

/* Font Montserrat 12px subset Latin-1 + Latin Extended-A/B + Extended Additional
 * (lv_font_vi_12.c, sinh từ lv_font_conv) — phủ dấu tiếng Việt mà
 * CONFIG_LV_FONT_MONTSERRAT_12 (chỉ Basic Latin) không có. */
LV_FONT_DECLARE(lv_font_vi_12);

/* ── Cấu hình panel / draw buffer ────────────────────────────────────── */
#define LCD_H_RES        SCR_W
#define LCD_V_RES        SCR_H
/* Draw buffer theo tỉ lệ chiều cao, không phụ thuộc một độ phân giải cụ thể. */
#ifdef CONFIG_SPIRAM
  #define LCD_DRAW_LINES ((LCD_V_RES + 3) / 4)
#else
  #define LCD_DRAW_LINES ((LCD_V_RES + 7) / 8)
#endif
#define LCD_CMD_BITS     8
#define LCD_PARAM_BITS   8
#define LVGL_TICK_MS     2
#define LVGL_TASK_MS     16      /* ~60 Hz xử lý LVGL */
#define MAP_REFRESH_MS   150     /* ~6–7 Hz invalidate map (tiết kiệm CPU) */

/* ── Màu sắc (LVGL v8 lv_color_t) ────────────────────────────────────── */
#define COL_BG          lv_color_black()
#define COL_ROAD        lv_color_hex(0x707070)
#define COL_ROUTE       lv_color_hex(0x2A7CFF)
#define COL_USER        lv_color_white()
#define COL_PANEL       lv_color_hex(0x101418)
#define COL_TEXT        lv_color_white()
#define COL_DOT_ON      lv_color_hex(0x33D17A)  /* xanh lá: đã kết nối */
#define COL_DOT_OFF     lv_color_hex(0x606060)  /* xám: chưa kết nối */
#define COL_LIMIT_RING  lv_color_hex(0xD01010)  /* viền đỏ biển tốc độ */
#define COL_OVER_BG     lv_color_hex(0xD01010)  /* nền đỏ khi vượt tốc */

/* ── Trạng thái module ───────────────────────────────────────────────── */
static esp_lcd_panel_handle_t s_panel = NULL;
static lv_disp_drv_t          s_disp_drv;
static lv_disp_draw_buf_t     s_draw_buf;
static lv_disp_t             *s_disp = NULL;

static SemaphoreHandle_t s_lvgl_mutex = NULL;  /* đệ quy: bảo vệ mọi gọi LVGL */

/* Widget overlay (xây 1 lần trong display_init). */
static lv_obj_t *s_map_obj      = NULL;  /* obj full-screen, custom draw map */
static lv_obj_t *s_turn_label   = NULL;  /* mũi tên rẽ */
static lv_obj_t *s_dist_label   = NULL;  /* "350 m" */
static lv_obj_t *s_street_label = NULL;  /* tên đường */
static lv_obj_t *s_limit_panel  = NULL;  /* biển tốc độ (badge) */
static lv_obj_t *s_limit_label  = NULL;
static lv_obj_t *s_speed_label  = NULL;  /* "42 km/h" */
static lv_obj_t *s_eta_label    = NULL;  /* "14:32 · 6.2 km" */
static lv_obj_t *s_ble_dot      = NULL;  /* chấm trạng thái BLE */
static lv_obj_t *s_clock_label  = NULL;  /* đồng hồ thực "07:42" */

static bool s_connected     = false;  /* lưu state nếu UI chưa dựng */
static bool s_ui_ready      = false;

/* ── Responsive layout helpers (tỉ lệ phần nghìn của màn hình) ─────────── */
static inline lv_coord_t ratio_w(uint16_t permille)
{
    lv_coord_t value = (lv_coord_t)(((uint32_t)LCD_H_RES * permille + 500u) / 1000u);
    return value > 0 ? value : 1;
}

static inline lv_coord_t ratio_h(uint16_t permille)
{
    lv_coord_t value = (lv_coord_t)(((uint32_t)LCD_V_RES * permille + 500u) / 1000u);
    return value > 0 ? value : 1;
}

static inline lv_coord_t ratio_min(uint16_t permille)
{
    const uint32_t side = LCD_H_RES < LCD_V_RES ? LCD_H_RES : LCD_V_RES;
    lv_coord_t value = (lv_coord_t)((side * permille + 500u) / 1000u);
    return value > 0 ? value : 1;
}

static const lv_font_t *font_for_ratio(uint16_t permille)
{
    lv_coord_t px = ratio_min(permille);
    if (px >= 22) return &lv_font_montserrat_24;
    if (px >= 19) return &lv_font_montserrat_20;
    if (px >= 16) return &lv_font_montserrat_18;
    if (px >= 13) return &lv_font_montserrat_14;
    if (px >= 11) return &lv_font_montserrat_12;
    if (px >= 9) return &lv_font_montserrat_10;
    return &lv_font_montserrat_8;
}

/* Snapshot chụp trước khi invalidate — dùng chung cho tất cả dải của 1 frame.
 * Đảm bảo mọi strip render cùng 1 bộ dữ liệu, không bị đứt đoạn giữa frame.
 * ESP32-S3 + PSRAM: cấp từ PSRAM (map_geom_t ~64 KB trên S3) — internal SRAM
 * giành cho DMA draw buffer + LVGL heap. H2: static .bss như cũ. */
#ifdef CONFIG_SPIRAM
  static map_geom_t *s_render_geom_p;
  #define s_render_geom (*s_render_geom_p)
#else
  static map_geom_t s_render_geom;
#endif
static map_pose_t s_render_pose;
static bool       s_render_ready = false;

/* ── Mutex helpers ───────────────────────────────────────────────────── */
static inline bool lvgl_lock(uint32_t timeout_ms)
{
    TickType_t ticks = (timeout_ms == 0) ? portMAX_DELAY : pdMS_TO_TICKS(timeout_ms);
    return xSemaphoreTakeRecursive(s_lvgl_mutex, ticks) == pdTRUE;
}
static inline void lvgl_unlock(void)
{
    xSemaphoreGiveRecursive(s_lvgl_mutex);
}

/* ── LVGL flush + panel callbacks ────────────────────────────────────── */

/* Panel báo xong DMA color-trans → cho LVGL biết flush đã ready (pattern chuẩn). */
static bool notify_flush_ready(esp_lcd_panel_io_handle_t io,
                               esp_lcd_panel_io_event_data_t *edata,
                               void *user_ctx)
{
    (void)io;
    (void)edata;
    lv_disp_drv_t *drv = (lv_disp_drv_t *)user_ctx;
    lv_disp_flush_ready(drv);
    return false;
}

/* LVGL flush 1 dải → đẩy bitmap ra ST7789. flush_ready gọi ở callback DMA. */
static void lvgl_flush_cb(lv_disp_drv_t *drv, const lv_area_t *area, lv_color_t *color_p)
{
    esp_lcd_panel_handle_t panel = (esp_lcd_panel_handle_t)drv->user_data;
    /* esp_lcd dùng x2/y2 exclusive (+1). */
    esp_lcd_panel_draw_bitmap(panel, area->x1, area->y1,
                              area->x2 + 1, area->y2 + 1, color_p);
}

