tiem-alpha/ESP32_NUS_NAV_MAP/esp32/main/display.c
/* esp_timer định kỳ → tick cho LVGL. */
static void lvgl_tick_cb(void *arg)
{
    (void)arg;
    lv_tick_inc(LVGL_TICK_MS);
}

/* ── Helpers chiếu/vẽ map ────────────────────────────────────────────── */

/* Kiểm tra 1 đoạn có giao vùng màn hình không (loại sớm đoạn ngoài hẳn). */
static inline bool seg_maybe_visible(const scr_pt_t *a, const scr_pt_t *b)
{
    if (a->x < 0 && b->x < 0)               return false;
    if (a->x >= LCD_H_RES && b->x >= LCD_H_RES) return false;
    if (a->y < 0 && b->y < 0)               return false;
    if (a->y >= LCD_V_RES && b->y >= LCD_V_RES) return false;
    return true;
}

/* Vẽ 1 polyline đã chiếu ra pixel. */
static void draw_polyline(lv_draw_ctx_t *draw_ctx, lv_draw_line_dsc_t *dsc,
                          const map_pt_t *pts, int n, const proj_ctx_t *proj)
{
    if (n < 2) {
        return;
    }
    scr_pt_t prev = projection_point(proj, pts[0].e_dm, pts[0].n_dm);
    for (int i = 1; i < n; i++) {
        scr_pt_t cur = projection_point(proj, pts[i].e_dm, pts[i].n_dm);
        if (seg_maybe_visible(&prev, &cur)) {
            lv_point_t p1 = { .x = prev.x, .y = prev.y };
            lv_point_t p2 = { .x = cur.x,  .y = cur.y  };
            lv_draw_line(draw_ctx, dsc, &p1, &p2);
        }
        prev = cur;
    }
}

/* Độ dày đường theo class: class nhỏ (đường lớn) → dày hơn. */
static inline lv_coord_t road_width_for_class(uint8_t road_class)
{
    if (road_class <= 1) return ratio_min(21); /* motorway/trunk */
    if (road_class <= 3) return ratio_min(17); /* primary/secondary */
    if (road_class <= 5) return ratio_min(13); /* tertiary/residential */
    return ratio_min(8);                         /* service/khác */
}

/* Vẽ mũi tên user: arrowhead khuyết đáy, fill trắng, hướng lên tại (USER_X, USER_Y).
 * 4 điểm: đỉnh trên → phải dưới → trọng tâm (indent đáy) → trái dưới.
 * Centroid = (USER_Y-10 + USER_Y+5 + USER_Y+5)/3 = USER_Y → vị trí GPS đúng tâm. */
static void draw_user_arrow(lv_draw_ctx_t *draw_ctx)
{
    const lv_coord_t half_w = ratio_min(29);
    const lv_coord_t tip_h = ratio_min(42);
    const lv_coord_t tail_h = ratio_min(21);
    const lv_point_t arrow[4] = {
        { USER_X,          USER_Y - tip_h  }, /* đỉnh trên */
        { USER_X + half_w, USER_Y + tail_h }, /* phải dưới */
        { USER_X,          USER_Y          }, /* indent đáy */
        { USER_X - half_w, USER_Y + tail_h }, /* trái dưới */
    };

    lv_draw_line_dsc_t dsc;
    lv_draw_line_dsc_init(&dsc);
    dsc.color = COL_USER;
    dsc.width = ratio_min(13);
    dsc.round_start = 1;
    dsc.round_end = 1;

    for (int i = 0; i < 3; i++) {
        lv_draw_line(draw_ctx, &dsc, &arrow[i], &arrow[i + 1]);
    }
    lv_draw_line(draw_ctx, &dsc, &arrow[3], &arrow[0]);
}

/* Custom draw map: chạy trong LV_EVENT_DRAW_MAIN của s_map_obj. */
static void map_draw_event_cb(lv_event_t *e)
{
    if (lv_event_get_code(e) != LV_EVENT_DRAW_MAIN) {
        return;
    }
    lv_draw_ctx_t *draw_ctx = lv_event_get_draw_ctx(e);
    if (!draw_ctx) {
        return;
    }

    /* Dùng snapshot đã chụp trong lvgl_task trước khi invalidate.
     * Đảm bảo tất cả dải strip của 1 frame dùng cùng dữ liệu — không đứt đoạn. */
    if (!s_render_ready) {
        return;
    }

    proj_ctx_t proj;
    projection_begin(&proj, &s_render_geom, &s_render_pose);

    /* 1) Roads (xám, độ dày theo class). */
    lv_draw_line_dsc_t road_dsc;
    lv_draw_line_dsc_init(&road_dsc);
    road_dsc.color = COL_ROAD;
    road_dsc.round_start = 1;
    road_dsc.round_end = 1;
    for (int r = 0; r < s_render_geom.road_n; r++) {
        const map_road_t *road = &s_render_geom.roads[r];
        road_dsc.width = road_width_for_class(road->road_class);
        draw_polyline(draw_ctx, &road_dsc, road->pts, road->n, &proj);
    }

    /* 2) Route (xanh, dày ~6). */
    lv_draw_line_dsc_t route_dsc;
    lv_draw_line_dsc_init(&route_dsc);
    route_dsc.color = COL_ROUTE;
    route_dsc.width = ratio_min(25);
    route_dsc.round_start = 1;
    route_dsc.round_end = 1;
    draw_polyline(draw_ctx, &route_dsc, s_render_geom.route, s_render_geom.route_n, &proj);

    /* 3) Mũi tên user trên cùng. */
    draw_user_arrow(draw_ctx);
}

/* ── Overlay: helper ─────────────────────────────────────────────────── */

/* Tạo panel bán trong suốt bo góc làm nền overlay. */
static lv_obj_t *make_panel(lv_obj_t *parent)
{
    lv_obj_t *p = lv_obj_create(parent);
    lv_obj_clear_flag(p, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_set_style_bg_color(p, COL_PANEL, 0);
    lv_obj_set_style_bg_opa(p, LV_OPA_70, 0);
    lv_obj_set_style_border_width(p, 0, 0);
    lv_obj_set_style_radius(p, ratio_min(33), 0);
    lv_obj_set_style_pad_all(p, ratio_min(25), 0);
    return p;
}

/* Glyph mũi tên theo maneuver (dùng ký tự ASCII/Unicode đơn giản). */
static const char *maneuver_glyph(maneuver_e m)
{
    switch (m) {
    case MAN_TURN_LEFT:
    case MAN_TURN_SLIGHT_LEFT:
    case MAN_TURN_SHARP_LEFT:
    case MAN_EXIT_LEFT:
    case MAN_ARRIVE_LEFT:
        return LV_SYMBOL_LEFT;
    case MAN_TURN_RIGHT:
    case MAN_TURN_SLIGHT_RIGHT:
    case MAN_TURN_SHARP_RIGHT:
    case MAN_EXIT_RIGHT:
    case MAN_ARRIVE_RIGHT:
        return LV_SYMBOL_RIGHT;
    case MAN_UTURN:
        return LV_SYMBOL_LOOP;
    case MAN_ARRIVE:
        return LV_SYMBOL_OK;
    case MAN_STRAIGHT:
    case MAN_DEPART:
    default:
        return LV_SYMBOL_UP;
    }
}

/* ── Xây UI ──────────────────────────────────────────────────────────── */
static void build_ui(void)
{
    const lv_coord_t margin = ratio_min(17);
    const lv_coord_t top_h = ratio_h(160);
    const lv_coord_t badge_size = ratio_min(192);
    const lv_coord_t bottom_h = ratio_h(106);
    const lv_coord_t left_text_x = ratio_w(150);

    lv_obj_t *scr = lv_scr_act();
    lv_obj_set_style_bg_color(scr, COL_BG, 0);
    lv_obj_set_style_bg_opa(scr, LV_OPA_COVER, 0);

    /* Layer nền: obj full-screen trong suốt với custom draw vẽ map. */
    s_map_obj = lv_obj_create(scr);
    lv_obj_remove_style_all(s_map_obj);
    lv_obj_set_size(s_map_obj, LCD_H_RES, LCD_V_RES);
    lv_obj_set_pos(s_map_obj, 0, 0);
    lv_obj_clear_flag(s_map_obj, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_set_style_bg_opa(s_map_obj, LV_OPA_TRANSP, 0);
    lv_obj_add_event_cb(s_map_obj, map_draw_event_cb, LV_EVENT_DRAW_MAIN, NULL);

