tiem-alpha/ESP32_NUS_NAV_MAP/esp32/main/display.c
    /* ── Overlay TRÊN-TRÁI: mũi tên rẽ + khoảng cách + tên đường. ── */
    lv_obj_t *top_left = make_panel(scr);
    lv_coord_t top_w = LCD_H_RES - badge_size - margin * 3;
    if (top_w < ratio_w(500)) top_w = ratio_w(500);
    lv_obj_set_size(top_left, top_w, top_h);
    lv_obj_align(top_left, LV_ALIGN_TOP_LEFT, margin, margin);

    s_turn_label = lv_label_create(top_left);
    lv_obj_set_style_text_font(s_turn_label, font_for_ratio(100), 0);
    lv_obj_set_style_text_color(s_turn_label, COL_TEXT, 0);
    lv_label_set_text(s_turn_label, LV_SYMBOL_UP);
    lv_obj_align(s_turn_label, LV_ALIGN_LEFT_MID, 0, -ratio_h(25));

    s_dist_label = lv_label_create(top_left);
    lv_obj_set_style_text_font(s_dist_label, font_for_ratio(83), 0);
    lv_obj_set_style_text_color(s_dist_label, COL_TEXT, 0);
    lv_label_set_text(s_dist_label, "-- m");
    lv_obj_align(s_dist_label, LV_ALIGN_TOP_LEFT, left_text_x, 0);

    s_street_label = lv_label_create(top_left);
    lv_obj_set_style_text_font(s_street_label, &lv_font_vi_12, 0);
    lv_obj_set_style_text_color(s_street_label, COL_TEXT, 0);
    lv_label_set_long_mode(s_street_label, LV_LABEL_LONG_DOT);
    lv_coord_t street_w = top_w - left_text_x - ratio_min(50);
    lv_obj_set_width(s_street_label, street_w > 1 ? street_w : 1);
    lv_label_set_text(s_street_label, "");
    lv_obj_align(s_street_label, LV_ALIGN_BOTTOM_LEFT, left_text_x, 0);

    /* ── Overlay TRÊN-PHẢI: biển tốc độ (badge tròn). ── */
    s_limit_panel = lv_obj_create(scr);
    lv_obj_clear_flag(s_limit_panel, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_set_size(s_limit_panel, badge_size, badge_size);
    lv_obj_align(s_limit_panel, LV_ALIGN_TOP_RIGHT, -margin, margin);
    lv_obj_set_style_radius(s_limit_panel, LV_RADIUS_CIRCLE, 0);
    lv_obj_set_style_bg_color(s_limit_panel, lv_color_white(), 0);
    lv_obj_set_style_bg_opa(s_limit_panel, LV_OPA_COVER, 0);
    lv_obj_set_style_border_color(s_limit_panel, COL_LIMIT_RING, 0);
    lv_obj_set_style_border_width(s_limit_panel, ratio_min(17), 0);
    lv_obj_set_style_pad_all(s_limit_panel, 0, 0);

    s_limit_label = lv_label_create(s_limit_panel);
    lv_obj_set_style_text_font(s_limit_label, font_for_ratio(75), 0);
    lv_obj_set_style_text_color(s_limit_label, lv_color_black(), 0);
    lv_label_set_text(s_limit_label, "");
    lv_obj_center(s_limit_label);
    lv_obj_add_flag(s_limit_panel, LV_OBJ_FLAG_HIDDEN);  /* ẩn tới khi có limit */

    /* ── Overlay DƯỚI-TRÁI: tốc độ hiện tại. ── */
    lv_obj_t *bot_left = make_panel(scr);
    lv_obj_set_size(bot_left, ratio_w(417), bottom_h);
    lv_obj_align(bot_left, LV_ALIGN_BOTTOM_LEFT, margin, -margin);

    s_speed_label = lv_label_create(bot_left);
    lv_obj_set_style_text_font(s_speed_label, font_for_ratio(75), 0);
    lv_obj_set_style_text_color(s_speed_label, COL_TEXT, 0);
    lv_label_set_text(s_speed_label, "0 km/h");
    lv_obj_center(s_speed_label);

    /* ── Overlay DƯỚI-PHẢI: ETA + còn lại. ── */
    lv_obj_t *bot_right = make_panel(scr);
    lv_obj_set_size(bot_right, ratio_w(500), bottom_h);
    lv_obj_align(bot_right, LV_ALIGN_BOTTOM_RIGHT, -margin, -margin);

    s_eta_label = lv_label_create(bot_right);
    lv_obj_set_style_text_font(s_eta_label, font_for_ratio(58), 0);
    lv_obj_set_style_text_color(s_eta_label, COL_TEXT, 0);
    lv_label_set_text(s_eta_label, "--:-- · -- km");
    lv_obj_center(s_eta_label);

    /* ── Chấm trạng thái BLE (góc trên giữa). ── */
    s_ble_dot = lv_obj_create(scr);
    lv_obj_clear_flag(s_ble_dot, LV_OBJ_FLAG_SCROLLABLE);
    lv_coord_t dot_size = ratio_min(50);
    lv_obj_set_size(s_ble_dot, dot_size, dot_size);
    lv_obj_align(s_ble_dot, LV_ALIGN_TOP_MID, 0, ratio_h(19));
    lv_obj_set_style_radius(s_ble_dot, LV_RADIUS_CIRCLE, 0);
    lv_obj_set_style_border_width(s_ble_dot, 0, 0);
    lv_obj_set_style_bg_color(s_ble_dot, s_connected ? COL_DOT_ON : COL_DOT_OFF, 0);
    lv_obj_set_style_bg_opa(s_ble_dot, LV_OPA_COVER, 0);

    // /* ── Đồng hồ thực, ngay dưới chấm BLE (giữa-trên). ── */
    // lv_obj_t *clock_panel = make_panel(scr);
    // lv_obj_set_size(clock_panel, 64, 24);
    // lv_obj_align(clock_panel, LV_ALIGN_TOP_MID, 0, 22);

    s_clock_label = lv_label_create(top_left);
    lv_obj_set_style_text_font(s_clock_label, font_for_ratio(83), 0);
    lv_obj_set_style_text_color(s_clock_label, COL_TEXT, 0);
    lv_label_set_text(s_clock_label, "--:--");
    lv_obj_align(s_clock_label, LV_ALIGN_TOP_RIGHT, 0, 0);

    s_ui_ready = true;
}

/* ── Cập nhật overlay từ nav_model ───────────────────────────────────── */
static void overlay_update(void)
{
    nav_overlay_t ov;
    nav_model_get(&ov);

    char buf[48];

    /* Mũi tên rẽ + khoảng cách. */
    if (ov.has_instruction) {
        lv_label_set_text(s_turn_label, maneuver_glyph(ov.maneuver));
        if (ov.dist_to_man_m >= 1000) {
            snprintf(buf, sizeof(buf), "%.1f km", ov.dist_to_man_m / 1000.0f);
        } else {
            snprintf(buf, sizeof(buf), "%u m", (unsigned)ov.dist_to_man_m);
        }
        lv_label_set_text(s_dist_label, buf);
        lv_label_set_text(s_street_label, ov.street);
    } else {
        lv_label_set_text(s_turn_label, LV_SYMBOL_UP);
        lv_label_set_text(s_dist_label, "-- m");
        lv_label_set_text(s_street_label, "");
    }

    /* Tốc độ hiện tại. */
    snprintf(buf, sizeof(buf), "%u km/h", (unsigned)ov.speed_kmh);
    lv_label_set_text(s_speed_label, buf);

    /* ETA + quãng còn lại. */
    if (ov.eta_min > 0 || ov.dist_remain_m > 0) {
        unsigned h = ov.eta_min / 60u;
        unsigned m = ov.eta_min % 60u;
        snprintf(buf, sizeof(buf), "%u:%02u · %.1f km",
                 h, m, ov.dist_remain_m / 1000.0f);
        lv_label_set_text(s_eta_label, buf);
    } else {
        lv_label_set_text(s_eta_label, "--:-- · -- km");
    }

    /* Đồng hồ thực (khác ETA — đó là thời lượng còn lại). */
    uint8_t clk_h, clk_m;
    if (clock_model_get_local(&clk_h, &clk_m)) {
        snprintf(buf, sizeof(buf), "%02u:%02u", (unsigned)clk_h, (unsigned)clk_m);
        lv_label_set_text(s_clock_label, buf);
    } else {
        lv_label_set_text(s_clock_label, "--:--");
    }

    /* Biển tốc độ: hiện khi >0, đỏ nền khi vượt. */
    if (ov.speed_limit_kmh > 0) {
        snprintf(buf, sizeof(buf), "%u", (unsigned)ov.speed_limit_kmh);
        lv_label_set_text(s_limit_label, buf);
        lv_obj_clear_flag(s_limit_panel, LV_OBJ_FLAG_HIDDEN);
        if (ov.is_over) {
            lv_obj_set_style_bg_color(s_limit_panel, COL_OVER_BG, 0);
            lv_obj_set_style_text_color(s_limit_label, lv_color_white(), 0);
        } else {
            lv_obj_set_style_bg_color(s_limit_panel, lv_color_white(), 0);
            lv_obj_set_style_text_color(s_limit_label, lv_color_black(), 0);
        }
    } else {
        lv_obj_add_flag(s_limit_panel, LV_OBJ_FLAG_HIDDEN);
    }
}

/* ── LVGL task ───────────────────────────────────────────────────────── */
static void lvgl_task(void *arg)
{
    (void)arg;
    uint32_t since_map_ms = 0;

