tiem-alpha/ESP32_NUS_NAV_MAP/esp32/main/display.c
    for (;;) {
        if (lvgl_lock(0)) {
            since_map_ms += LVGL_TASK_MS;
            if (s_ui_ready && since_map_ms >= MAP_REFRESH_MS) {
                since_map_ms = 0;

                /* Overlay + map trong cùng 1 chu kỳ → 1 lần redraw duy nhất,
                 * tránh partial redraws lệch pha gây giật. */
                overlay_update();

                /* Chụp snapshot pose + geom TRƯỚC khi invalidate.
                 * map_draw_event_cb (gọi 1 lần/dải) dùng lại snapshot này
                 * → mọi strip thấy cùng dữ liệu, không đứt đoạn giữa frame. */
                if (map_model_has_pose()) {
                    map_model_get_pose(&s_render_pose);
                    const map_geom_t *g = map_model_lock_geom();
                    if (g) {
                        s_render_geom  = *g;
                        map_model_unlock_geom();
                        s_render_ready = true;
                    } else {
                        s_render_ready = false;
                    }
                } else {
                    s_render_ready = false;
                }

                lv_obj_invalidate(s_map_obj);
            }
            lv_timer_handler();
            lvgl_unlock();
        }
        vTaskDelay(pdMS_TO_TICKS(LVGL_TASK_MS));
    }
}

/* ── Khởi tạo panel ST7789 qua esp_lcd ───────────────────────────────── */
static esp_lcd_panel_io_handle_t panel_init(void)
{
    /* Backlight bật trước (nếu có chân). */
#if CONFIG_LCD_BL_GPIO >= 0
    gpio_config_t bl_cfg = {
        .mode = GPIO_MODE_OUTPUT,
        .pin_bit_mask = 1ULL << CONFIG_LCD_BL_GPIO,
    };
    gpio_config(&bl_cfg);
    gpio_set_level(CONFIG_LCD_BL_GPIO, 1);
#endif

    /* SPI bus (SPI2_HOST). max_transfer = 1 dải draw buffer. */
    spi_bus_config_t bus_cfg = {
        .mosi_io_num = CONFIG_LCD_MOSI_GPIO,
        .sclk_io_num = CONFIG_LCD_SCLK_GPIO,
        .miso_io_num = -1,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .max_transfer_sz = LCD_H_RES * LCD_DRAW_LINES * sizeof(lv_color_t),
    };
    ESP_ERROR_CHECK(spi_bus_initialize(SPI2_HOST, &bus_cfg, SPI_DMA_CH_AUTO));

    /* Panel IO (SPI). color-trans-done → notify_flush_ready. */
    esp_lcd_panel_io_handle_t io = NULL;
    esp_lcd_panel_io_spi_config_t io_cfg = {
        .dc_gpio_num = CONFIG_LCD_DC_GPIO,
        .cs_gpio_num = CONFIG_LCD_CS_GPIO,
        .pclk_hz = CONFIG_LCD_SPI_CLOCK_MHZ * 1000 * 1000,
        .lcd_cmd_bits = LCD_CMD_BITS,
        .lcd_param_bits = LCD_PARAM_BITS,
        .spi_mode = 0,
        .trans_queue_depth = 10,
        .on_color_trans_done = notify_flush_ready,
        .user_ctx = &s_disp_drv,
    };
    ESP_ERROR_CHECK(esp_lcd_new_panel_io_spi(SPI2_HOST, &io_cfg, &io));

    /* Panel ST7789. Tên field thứ tự màu đổi giữa các bản IDF v5.x:
     * >=5.3 dùng rgb_ele_order; cũ hơn dùng rgb_endian. */
    esp_lcd_panel_dev_config_t panel_cfg = {
        .reset_gpio_num = CONFIG_LCD_RST_GPIO,
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0)
        .rgb_ele_order = LCD_RGB_ELEMENT_ORDER_RGB,
#else
        .rgb_endian = LCD_RGB_ENDIAN_RGB,
#endif
        .bits_per_pixel = 16,
    };
    ESP_ERROR_CHECK(esp_lcd_new_panel_st7789(io, &panel_cfg, &s_panel));

    ESP_ERROR_CHECK(esp_lcd_panel_reset(s_panel));
    ESP_ERROR_CHECK(esp_lcd_panel_init(s_panel));
    /* ST7789 thường cần đảo màu để hiển thị đúng. */
    ESP_ERROR_CHECK(esp_lcd_panel_invert_color(s_panel, false));
    ESP_ERROR_CHECK(esp_lcd_panel_disp_on_off(s_panel, true));

    return io;
}

/* ── API công khai ───────────────────────────────────────────────────── */
void display_init(void)
{
    /* Mutex đệ quy bảo vệ mọi gọi LVGL. */
    s_lvgl_mutex = xSemaphoreCreateRecursiveMutex();

#ifdef CONFIG_SPIRAM
    /* Snapshot render từ PSRAM — trên S3 map_geom_t ~64 KB.
     * LVGL không đọc trực tiếp buffer này qua DMA nên PSRAM là OK. */
    s_render_geom_p = heap_caps_malloc(sizeof(map_geom_t), MALLOC_CAP_SPIRAM);
    assert(s_render_geom_p);
    memset(s_render_geom_p, 0, sizeof(map_geom_t));
    ESP_LOGI(DISP_TAG, "render_geom in PSRAM (%u B)", (unsigned)sizeof(map_geom_t));
#endif

    /* 1) Panel ST7789. */
    panel_init();

    /* 2) LVGL + partial draw buffer (DMA internal RAM — bắt buộc, SPI DMA
     * không truy cập PSRAM trực tiếp trên cả H2 và S3 SPI mode). */
    lv_init();

    size_t buf_px = LCD_H_RES * LCD_DRAW_LINES;
    lv_color_t *buf1 = heap_caps_malloc(buf_px * sizeof(lv_color_t),
                                        MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL);
    lv_color_t *buf2 = heap_caps_malloc(buf_px * sizeof(lv_color_t),
                                        MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL);
    assert(buf1 && buf2);
    lv_disp_draw_buf_init(&s_draw_buf, buf1, buf2, buf_px);

    lv_disp_drv_init(&s_disp_drv);
    s_disp_drv.hor_res   = LCD_H_RES;
    s_disp_drv.ver_res   = LCD_V_RES;
    s_disp_drv.flush_cb  = lvgl_flush_cb;
    s_disp_drv.draw_buf  = &s_draw_buf;
    s_disp_drv.user_data = s_panel;
    s_disp = lv_disp_drv_register(&s_disp_drv);

    /* 3) LVGL tick qua esp_timer định kỳ. */
    const esp_timer_create_args_t tick_args = {
        .callback = lvgl_tick_cb,
        .name = "lv_tick",
    };
    esp_timer_handle_t tick_timer = NULL;
    ESP_ERROR_CHECK(esp_timer_create(&tick_args, &tick_timer));
    ESP_ERROR_CHECK(esp_timer_start_periodic(tick_timer, LVGL_TICK_MS * 1000));

    /* 4) Dựng UI (bọc mutex). */
    if (lvgl_lock(0)) {
        build_ui();
        lvgl_unlock();
    }

    /* 5) Task render LVGL.
     * S3 dual-core: pin vào core 1 (APP_CPU) để BLE task chạy độc lập core 0.
     * H2 single-core: xTaskCreate thường (core không quan trọng). */
#ifdef CONFIG_SPIRAM
    xTaskCreatePinnedToCore(lvgl_task, "lvgl_task", 12 * 1024, NULL, 2, NULL, 1);
#else
    xTaskCreate(lvgl_task, "lvgl_task", 8 * 1024, NULL, 2, NULL);
#endif

    ESP_LOGI(DISP_TAG, "Display + LVGL ready (partial buf %dx%d x2)",
             LCD_H_RES, LCD_DRAW_LINES);
}

void display_set_connected(bool connected)
{
    s_connected = connected;
    if (!s_lvgl_mutex) {
        return;  /* gọi quá sớm: chỉ lưu state, build_ui sẽ áp dụng */
    }
    if (lvgl_lock(100)) {
        if (s_ui_ready && s_ble_dot) {
            lv_obj_set_style_bg_color(s_ble_dot,
                                      connected ? COL_DOT_ON : COL_DOT_OFF, 0);
        }
        lvgl_unlock();
    }
}
